;в dl – початкове довільне значення, в dh потрібно занести результат 
;початкова нумерація розрядів числа:     7 6 5 4 3 2 1 0
;переміщення значень розрядів з dl в dh: 6 6 7 2 2 5 3 1

data	SEGMENT		byte	;відкриття сегменту

data	ENDS				;закриття сегменту

code	SEGMENT				;відкриття сегменту
	  ASSUME cs:code, ds:data

begin:
	  mov ax, data
	  mov ds, ax
	  
mov dl, 10101010b	;початкове значенння

mov al, dl     		;створення копії dl, в al
and al, 01000000b 	;залишаємо незмінним 6 біт
mov dh, al			;зберігаємо отримане значенння в dh(=0000 0000b/00h)

;продовжуємо працювати з 6 бітом
mov cl, 1			;задаємо в cl лічильник зсувів
shl al, cl			;зсуваємо на один розряд вліво

or dh, al			;додаємо отримане значення до dh(=0000 0000b/00h)


mov al, dl     		;створення копії dl, в al
and al, 10000000b 	;залишаємо незмінним 7 біт

mov cl, 2			;задаємо в cl лічильник зсувів
shr al, cl			;зсуваємо на два розряди вправо

or dh, al			;додаємо отримане значення до dh(=0010 0000/20h)


mov al, dl     		;створення копії dl, в al
and al, 00100000b 	;залишаємо незмінним 5 біт

mov cl, 3			;задаємо в cl лічильник зсувів
shr al, cl			;зсуваємо вправо на три розряди 

or dh, al			;додаємо отримане значення до dh(=0010 0100/24h);


mov al, dl     		;створення копії dl, в al
and al, 00001000b 	;залишаємо незмінним 3 біт

mov cl, 2			;задаємо в cl лічильник зсувів
shr al, cl			;зсуваємо вправо на два розряди 

or dh, al			;додаємо отримане значення до dh(=0010 0110/26h)

mov al, dl     		;створення копії dl, в al
and al, 00000100b 	;залишаємо незмінним 2 біт

mov cl, 1			;задаємо в cl лічильник зсувів
shl al, cl			;зсуваємо вліво на один розряд 

or dh, al			;додаємо отримане значення до dh(=0010 0110/26h)

;продовжуємо працювати з 2 бітом
shl al, cl			;зсуваємо вліво на один розряд 

or dh, al			;додаємо отримане значення до dh(=0010 0110/26h)


mov al, dl     		;створення копії dl, в al
and al, 00000010b 	;залишаємо незмінним 1 біт

mov cl, 1			;задаємо в cl лічильник зсувів
shr al, cl			;зсуваємо вправо на один розряд 

or dh, al			;додаємо отримане значення до dh(=0010 0111/27h)


		nop			;відсутність операції, місце зупинки відлагоджувача
		nop
		nop
		mov		ax,4c00h	;вихід в MS-DOS для завершення
		int		21h			;виконання програми
		
code	ENDS			; закриття сегмента
        end      begin	; кінець  програми з вказівкою початкової мітки програми - begin
						; точки входу в програму
